package com.example.dustbin.tools;

public class Codes {

    public static byte[] openDryTrush = {(byte) 'A'};//干垃圾
    public static byte[] closeDryTrush = {(byte) 'a'};//干垃圾
    public static byte[] openwettrush = {(byte) 'B'};//干垃圾
    public static byte[] closewettrush = {(byte) 'b'};//干垃圾
    public static byte[] openrecycletrush = {(byte) 'C'};//干垃圾
    public static byte[] closerecycletrush = {(byte) 'c'};//干垃圾
    public static byte[] openhazaroustrush = {(byte) 'D'};//干垃圾
    public static byte[] closehazaroustrush = {(byte) 'd'};//干垃圾


    public static String[] RecyGarbage = { "纸板箱", "报纸", "废弃书本", "快递纸袋", "打印纸", "信封", "广告单", "纸塑铝复合包装", "瓶罐", "瓶盖", "饮料瓶", "洗发水瓶", "乳液罐", "食用油桶", "塑料碗", " 盆", "塑料盒子", "食品保鲜盒", "收纳盒", "塑料玩具 ", "塑料积木", "塑料模型", "塑料衣架", "施工安全帽 ",  "塑料 ", "pvc", "亚克力板", "塑料卡片", "密胺餐具", "kt板", "泡沫", "泡沫塑料", "水果网套", "玻璃瓶罐", "调料瓶", "酒瓶", "化妆品瓶", "玻璃杯", "窗玻璃", "玻璃制品", "放大镜", "玻璃摆件", "碎玻璃", "金属瓶罐", "易拉罐", "食品罐", "食品桶", "金属厨具", "菜刀", "锅", "刀片", "指甲剪", "螺丝刀", "铁钉", "铁皮", "铝箔 ", "旧衣服", "床单", "枕头", "棉被", "皮鞋", "毛绒玩具", "布偶", "棉袄",  "皮带", "丝绸制品", "电路板", "主板", "内存条", "充电宝", "电线", "插头", "木制品", "积木", "砧板" };//可回收垃圾
    public static String[] UnRecyGarbage = { "果皮", " 菜叶", "剩菜剩饭", "饭后垃圾", "卫生纸", "餐巾纸", "充电电池", "镉镍电池", "铅酸电池", "蓄电池", "纽扣电池", "荧光灯管", "卤素灯", "过期药物", "药物胶囊", "药片", "药品内包装", "废油漆桶", "染发剂壳", "过期的指甲油", "洗甲水", "废矿物油及其包装物 ", "水银血压计", "水银体温计", "水银温度计" };//不可回收垃圾
    public static String[] DryGarbage = { "餐巾纸", "卫生间用纸", "尿不湿", "猫砂", "狗尿垫", "污损纸张", "烟蒂", "干燥剂", "污损塑料", "尼龙制品", "编织袋", "防碎气泡膜", "大骨头", "硬贝壳", "椰子壳", "榴莲壳", "核桃壳", "玉米衣", "甘蔗皮", "榴莲核", "菠萝蜜核", "毛发", "灰土", "炉渣", "橡皮泥", "太空沙", "胶水", "胶带", "花盆", "毛巾", "一次性餐具", "镜子", "陶瓷制品", "竹篮", "竹筷", "牙签", "伞", "笔", "眼镜", "打火机" };//干垃圾
    public static String[] WetGarbage = {  "米饭",  "面包", "豆类", "肉蛋", "鸡", "鸭", "牛", "羊肉", "蛋", "动物内脏", "腊肉", "午餐肉", "蛋壳", "鱼", "鱼鳞", "虾", "虾壳", "鱿鱼", "蔬菜", "绿叶菜", "根茎蔬菜", "菌菇", "调料", "火锅汤底", "沥干后的固体废弃物", "鱼骨", "碎骨", "茶叶渣", "咖啡渣", "糕饼", "糖果", "肉干", "红枣", "中药材", "冲泡饮料", "面粉", "宠物饲料", "水果果肉", "椰子肉", "水果果皮", "西瓜皮", "桔子皮", "苹果皮", "葡萄枝", "西瓜籽", "家养绿植", "花卉", "花瓣", "枝叶", "中药药渣" };//湿垃圾


}
